OpenFOAM-v2412/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd46
// -*- C++ -*-

stdmd46
{
    ${stdmd01}

    field          UPrime2Mean;
    patch          outlet;
}


// ************************************************************************* //
